tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# databases
brew "mysql", restart_service: true
brew "postgresql@14"
brew "redis", restart_service: true

# terminal tools
brew "neovim"
brew "fish"
brew "lazygit"

# tools / languages
brew "go"
brew "hugo"
brew "pipx"
brew "pyenv"
brew "gsed"
brew "git"
brew "wget"
brew "ripgrep"
brew "bat"
brew "fzf"

# apps i use on daily basis
cask "arc"
cask "spotify"
cask "slack"
cask "docker"
cask "raycast"
cask "google-chrome"
cask "ghostty"
cask "cloudflare-warp"
cask "visual-studio-code"

# fonts
cask "font-meslo-lg-nerd-font"
