tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "ngrok/ngrok"

# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# GNOME accessibility toolkit
brew "atk"
brew "autopep8"
# Decentralized dependency manager for Cocoa
brew "carthage"
brew "curl"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
brew "go"
brew "gobject-introspection"
brew "hugo"
brew "mysql", restart_service: true
brew "neofetch"
brew "neovim"
brew "nginx"
brew "php@7.4"
brew "pipenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "zsh-syntax-highlighting"
cask "ngrok"
cask "iterm2"
brew "python@3.11"
brew "zsh"
brew "git"
brew "docker"
brew "wget"
brew "postgresql@14"
brew "go"
# node version manager
brew "nvm"

# apps i use on daily basis
cask "discord"
cask "microsoft-teams"
cask "spotify"
cask "google-chrome"
cask "telegram"
cask "notion"
cask "insomnia"
cask "slack"
