tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "ngrok/ngrok"

brew "autopep8"
brew "go"
brew "mysql", restart_service: true
brew "neofetch"
brew "neovim"
brew "pipenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "pyenv"
brew "git"
brew "wget"
brew "postgresql@14"
brew "go"
brew "lazygit"
brew "neovide"
brew "hugo"
brew "fish"
brew "gsed"
cask "ngrok"

# apps i use on daily basis
cask "discord"
cask "arc"
cask "microsoft-teams"
cask "spotify"
cask "telegram"
cask "insomnia"
cask "slack"
cask "docker"
cask "obsidian"
cask "iterm2"
cask "raycast"
