astro-build.astro-vscode
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
firsttris.vscode-jest-runner
github.copilot
github.github-vscode-theme
gleam.gleam
golang.go
gruntfuggly.todo-tree
inferrinizzard.prettier-sql-vscode
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.remote-explorer
redhat.vscode-yaml
shazbot.surroundelection
streetsidesoftware.code-spell-checker
tomrijndorp.find-it-faster
vscodevim.vim
zignd.html-css-class-completion
